# Criando os nomes

In [1]:
import pandas as pd

In [2]:
# https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=20&sexo=f

In [7]:
nomes_f = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f")
nomes_f

          nome  regiao      freq  rank sexo
0        MARIA       0  11694738     1    F
1          ANA       0   3079729     2    F
2    FRANCISCA       0    721637     3    F
3      ANTONIA       0    588783     4    F
4      ADRIANA       0    565621     5    F
..         ...     ...       ...   ...  ...
195     ROSANE       0     82203   196    F
196    IVONETE       0     81878   197    F
197    LUCIANE       0     81230   198    F
198    ISADORA       0     81100   199    F
199      NILZA       0     80128   200    F

[200 rows x 5 columns]

In [8]:
nomes_m = pd.read_json("https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m")
nomes_m

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [9]:
frames = [ nomes_f, nomes_m]

In [11]:
nomes = pd.concat(frames)['nome'].to_frame()

In [12]:
nomes.sample(5)

         nome
153      CAUA
91      CELIA
166     KELLY
159     SELMA
178  DENILSON

# Incluindo ID dos alunos

In [13]:
import numpy as np

In [14]:
np.random.seed(123)

In [15]:
total_alunos = len(nomes)
total_alunos

400

In [17]:
nomes["id_aluno"] = np.random.permutation(total_alunos) + 1

In [52]:
nomes.sample(3)

        nome  id_aluno
70   ISABELA        73
143   OTAVIO       272
168     IARA        82